Tekla Open API Reference for Tekla Structures 2025
Task.Url Property
 A link to material or data related to the task. The link can be a hyperlink or a file system link.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Url { get; set; }
Public Property Url As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Task Class
Tekla.Structures.Model Namespace